//
//  DataPosts.swift
//  Navigat1on
//
//  Created by Илья Сидорик on 19.01.2023.
//

import Foundation
import UIKit

class DataPosts {
    static var dataPosts: [PostView] = [
        PostView(author: "ЛучшаяМама23",
                 description: "Бла Бла бла бла бла бла бла бла бла бла бла бла Бла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла блаБла Бла бла бла бла бла бла бла бла бла бла бла",
                 image: UIImage(named: "1"),
                 likes: 145,
                 views: 570,
                 id: UUID().uuidString
                ),
        PostView(author: "ЛучшийПапа19",
                 description: "Лучшее фото - смешное фото",
                 image: UIImage(named: "2"),
                 likes: 269,
                 views: 490,
                 id: UUID().uuidString
                ),
        PostView(author: "БабушкаНеЛегкогоПоведения",
                 description: "Опять внучу от меня забрали! Так скучаю:(((",
                 image: UIImage(named: "7"),
                 likes: 83,
                 views: 237,
                 id: UUID().uuidString
                ),
        PostView(author: "БабушкаНеЛегкогоПоведения2",
                 description: "Наконец поняньчусь с любимой внученькой",
                 image: UIImage(named: "4"),
                 likes: 175,
                 views: 312,
                 id: UUID().uuidString
                ),
        ]
}
